import React from "react";
import { Box, Container, Typography } from "@mui/material";

const PrivaceyRules = () => {
  return (
    <Container>
      <Box sx={{ marginTop: "17rem" }}>
        <Typography variant="h4" sx={{ color: "var(--green-color)" }}>
          اتفاقية الشروط والأحكام
        </Typography>
        <Typography sx={{ marginTop: "2rem" }}>
          آخر تحديث لهذه الاتفاقية كان بتاريخ 14 / 06 / 2023 م
        </Typography>
        <Typography sx={{ marginTop: "2rem", fontWeight: "bold" }}>
          مقدمة
        </Typography>
        <Typography marginY="1rem">
          عبر دخولك واستخدامك (منصة عقارتك) التي تشغلها (شركة تطبيق عقارتك
          التجارية) فإنك تقر وتوافق، دون أي تعديل أو قيود أو تبديل، على اتفاقية
          الشروط والأحكام هذه وعلى أية سياسات أخرى تحكم الاستفادة من خدمات (منصة
          عقارتك)، وتقر وتضمن أهليتك القانونية للدخول في هذه الاتفاقية وفقاً
          لجميع الشروط والأحكام الواردة فيها.
        </Typography>
        <Typography marginY="1rem">
          يجب عليك قراءة الشروط والأحكام في كل مرة تقوم باستخدام (منصة عقارتك)
          لضمان أنك على علم بكل الشروط والأحكام السارية حاليًا. وفقًا لذلك، فإن
          استمرارك باستخدامك لأي من (منصة عقارتك) يعتبر موافقة منك على أي تغيير
          في الشروط والأحكام.
        </Typography>
        <Typography marginY="1rem">
          إن اتفاقية الشروط والأحكام التي تم نشرها على (منصة عقارتك) وضعت لحماية
          وحفظ حقوق كل من (شركة تطبيق عقارتك التجارية) و المستخدمين الذين
          يستفيدون من خدمات (منصة عقارتك) بتسجيل أو من دون تسجيل.
        </Typography>
        <Typography
          sx={{ marginTop: "2rem", fontWeight: "bold", marginY: "1rem" }}
        >
          التعريفات
        </Typography>
        <ul style={{ marginRight: "30px", padding: "0" }}>
          <li>
            <p style={{ fontWeight: "bold", marginLeft: "5px" }}>
              شركة تطبيق عقارتك التجارية:
            </p>
            <p>
              {" "}
              هي شركة مسجلة في المملكة العربية السعودية ومقرها الرئيس في مدينة
              الرياض، المملكة العربية السعودية، وتدير وتشغل خدمات (منصة عقارتك).
            </p>
          </li>
          <li>
            <p style={{ fontWeight: "bold", marginLeft: "5px" }}>
              منصة عقارتك:
            </p>
            <p>
              المواقع و التطبيقات التي تقدم شركة تطبيق عقارتك التجارية الخدمات
              التسويقية والعقارية والسياحية من خلالها،وتشمل على سبيل المثال لا
              الحصر:
            </p>
          </li>

          <li>
            موقع عقارتك
            <a
              href="/https://www.dashboard.aqartik.com"
              style={{ marginRight: "5px" }}
            >
              (https://www.dashboard.aqartik.com/)
            </a>
          </li>
          <li>
            <p style={{ fontWeight: "bold", marginLeft: "5px" }}> المستخدم:</p>
            <p>
              هو الشخص الحقيقي أو الاعتباري الذي ليصل أو يستخدم إلى (منصة
              عقارتك) للاستفادة من الخدمات التي تقدم من خلال المنصة سواء بتسجيل
              أو بدون تسجيل. ويشار إليهم مجتمعين في هذه الاتفاقية بـ
              (المستخدمين)
            </p>
          </li>
        </ul>
        <Typography
          sx={{ marginTop: "2rem", fontWeight: "bold", marginY: "1rem" }}
        >
          المادة الأولى: الأحكام العامة
        </Typography>
        <ol style={{ marginRight: "20px" }}>
          <li>
            تخضع بنود هذه الاتفاقية لكافة الأنظمة والتشريعات والتعليمات سارية
            المفعول بالمملكة العربية السعودية.
          </li>
          <li>
            ذا أصبح أي حكم من أحكام هذه الاتفاقية غير قانوني أو لاغي أو غير ساري
            المفعول بموجب أية أنظمة أو قوانين أو أحكام قضائية، فإن باقي الأحكام
            والشروط الأخرى في هذه الاتفاقية تبقى فاعلة وسارية المفعول وقانونية
            ومعمول بها في هذه الاتفاقية وقابلة للتطبيق بموجب القوانين.{" "}
          </li>
          <li>
            {" "}
            تسعى (شركة تطبيق عقارتك التجارية) قدر الإمكان إلى توفير المعلومات
            على (منصة عقارتك) بدقة متناهية، إلا أنه قد ترد بعض الأخطاء من حين
            لآخر، ولا تتحمل (شركة تطبيق عقارتك التجارية) أي مسؤولية عن أي خطأ في
            المعلومات التي تتضمنها (منصة عقارتك).
          </li>
        </ol>
        <Typography
          sx={{ marginTop: "2rem", fontWeight: "bold", marginY: "1rem" }}
        >
          المادة الثانية: الاستخدام المقبول
        </Typography>
        <p style={{ marginTop: "1rem", marginBottom: "1rem" }}>
          عند قيامك بنشر أي إعلان عقاري على (منصة عقارتك) فإنك تقر وتلتزم
          بالتالي:
        </p>
        <ol style={{ marginRight: "20px" }}>
          <li>
            تقر وتضمن أهليتك القانونية للدخول في هذه الاتفاقية وفقاً لجميع
            الشروط والأحكام الواردة فيها.
          </li>
          <li>
            استخدام الموقع بصفتك الشخصية أو بالنيابة عن شخص لك الحق في تمثيله
            على (منصة عقارتك) (على سبيل المثال لا الحصر: عن طريق الوكالة أو
            التوظيف) فقط، وعدم استخدام (منصة عقارتك) بصفة أي شخص لا يحق لك
            تمثيله.
          </li>
          <li>
            ضمان صحة كافة المعلومات المدخلة في (منصة عقارتك) سواء كانت معلومات
            المستخدم أو مدخلة كمواد أو محتوى للمشاركة أو الإعلان عبر (منصة
            عقارتك).
          </li>
          <li>عدم مشاركة أي معلومات ليس لديك حق نشرها أو مشاركتها.</li>
          <li>
            عدم عن نسخ أي محتوى من (منصة عقارتك) وإعادة نشره في مواقع أخرى بدون
            موافقة مالك المحتوى.
          </li>
          <li>
            تحمل مسؤولية التحقق من تفاصيل أي محتوى منشور على (منصة عقارتك)
            وتأكيده والاطمئنان إلى صحتها وتتحمل مسؤولية الاستعانة بأي مختص فني
            أو الحصول على المشورة القانونية قبل الالتزام بأي عملية، وتتحمل
            مسؤولية ضمان تصرفك بحسن نية تجاه أي أطراف أخرى.
          </li>
          <li>
            دفع كافة الرسوم المترتبة على خدمات (منصة عقارتك) عند استحقاقها.
          </li>
          <li>
            انطباق كافة الاشتراطات والالتزامات الحكومية عليك وحصولك على كافة
            التراخيص المطلوبة للاستفادة من خدمات (منصة عقارتك).
          </li>
          <li>
            عدم التعدي على أي مستخدم آخر داخل (منصة عقارتك) أو محاولة الغش أو
            الكذب أو التدليس لإلحاق الضرر بأي مستخدم آخر.
          </li>
          <li>
            عدم استخدام أي وسيلة (بما في ذلك -على سبيل المثال لا الحصر- محاولة
            إخفاء الهوية عبر برامج الـVPN أو البروكسي Proxy) لانتهاك الشروط
            والأحكام في (منصة عقارتك) أو لتجاوز الإجراءات الوقائية التي تطبقها
            (منصة عقارتك) عند مخالفة الشروط والأحكام أو للوصول لمحتوى (منصة
            عقارتك) بشكل غير مسموح أو لتجميع وتحصيل معلومات وبيانات تخص (منصة
            عقارتك) أو مستخدميها والاستفادة منها بأي شكل من الأشكال أو إعادة
            نشرها بدون إذن.
          </li>
          <li>
            عدم نشر أو توزيع أو تحميل أي مواد تشهيرية أو هجومية أو انتهاكية أو
            مضرة أو تهديدية أو مسيئة أو ملتوية أو عنصرية أو غير ملائمة أخلاقياً
            أو غير ذلك من محتوى أو معلومات غير قانونية
          </li>
          <li>
            عدم نشر أي محتوى أو مواد وهمية أو تخمينية أو تعليقات كاذبة أو غير
            دقيقة أو مضللة أو خادعة أو قذف أو تشهير.
          </li>
          <li>
            عدم التعرض للسياسات أو السيادات الدولية أو الشخصيات المعتبرة أو أي
            مناقشات لا تتعلق بالخدمات المقدمة على (منصة عقارتك).
          </li>
          <li>
            عدم انتهاك حقوق الطبع والنشر والعلامات التجارية، وبراءات الاختراع
            والدعاية وقواعد البيانات أو غيرها من حقوق الملكية أو الفكرية التي
            تملكها (شركة تطبيق عقارتك التجارية) أو مرخصة لـ(شركة تطبيق عقارتك
            التجارية).
          </li>
          <li>
            عدم انتحال صفة (شركة تطبيق عقارتك التجارية) أو ممثل لها أو موظف
            فيهًا أو أي صفة توحي بأنك تابع لـ(شركة تطبيق عقارتك التجارية) ما لم
            يكن لديك إذن رسمي من (شركة تطبيق عقارتك التجارية).
          </li>
          <li>
            درء الضرر عن (شركة تطبيق عقارتك التجارية) وتعويضها عن أي وكافة
            الالتزامات والخسائر والدعاوى والنفقات (بما في ذلك الرسوم القانونية)
            والأضرار (سواء المباشرة أو غير المباشرة) التي تنشأ عن المطالبات
            الناتجة عن إساءة استخدامك لـ(منصة عقارتك)، بما في ذلك ودون حصر أي
            مطالبات تتضمن مزاعم تثبتُ صِحتُها وتُشكل انتهاكاً من جانبك لهذه
            الاتفاقية.
          </li>
          <li>
            تحمل كافة المسؤولية القانونية والجنائية الناتجة عن أي مخالفة من قبل
            (المستخدم) لاتفاقية الشروط والأحكام.
          </li>
        </ol>
        <Typography
          sx={{ marginTop: "2rem", fontWeight: "bold", marginY: "1rem" }}
        >
          المادة الثالثة: أحكام خدمة (الإعلانات العقارية)
        </Typography>
        <p style={{ marginTop: "1rem", marginBottom: "1rem" }}>
          عند قيامك بنشر أي إعلان عقارتك على (منصة عقارتك) فإنك تقر وتلتزم
          بالتالي:
        </p>
        <ol style={{ marginRight: "20px" }}>
          <li>
            تطبيق كافة الأنظمة والقوانين والتشريعات ذات العلاقة والحصول على كافة
            التراخيص والتصاريح النظامية المطلوبة للعقار المعروض وتوفر الأهلية
            والأحقية القانونية للإعلان العقاري وتحمل تبعات أي مخالفة لذلك.
          </li>
          <li>
            تحري الدقة في جميع معلومات الإعلان المعروض وأنها صحيحة (على سبيل
            المثال لا الحصر: القسم والتصنيف والصور والسعر والخدمات والوصف
            والموقع وأي اشتراطات أو قيود على العقار)، والتعهد بإبقاء تلك
            المعلومات محدثة على الدوام في (منصة عقارتك) وتحمل تبعات عدم تحديثها.
          </li>
          <li>عدم إمكانية تعديل نوع ومكان الإعلان بعد نشره.</li>
          <li>التفاعل والرد على تواصل المستخدمين بخصوص الإعلان.</li>
          <li>
            دفع عمولة الإعلان المفروضة عند إتمام التصرف العقاري (في حالة عدم
            الإعفاء من الرسوم).
          </li>
        </ol>
        <Typography
          sx={{ marginTop: "2rem", fontWeight: "bold", marginY: "1rem" }}
        >
          المادة الرابعة: أحكام خدمة (الطلبات العقار)
        </Typography>
        <p style={{ marginTop: "1rem", marginBottom: "1rem" }}>
          عند قيامك بنشر أي طلب عقاري على(منصة عقارتك) فإنك تقر وتلتزم بالتالي:
        </p>
        <ol style={{ marginRight: "20px" }}>
          <li>الجدية في الطلب العقاري ودقة البيانات المدخلة فيه.</li>
          <li>التفاعل مع المستخدمين الذين يريدون التواصل.</li>
          <li>عدم نشر طلبات وهمية لأي سبب.</li>
          <li>دفع أي رسوم مفروضة على نشر الطلب العقاري.</li>
        </ol>
        <Typography
          sx={{ marginTop: "2rem", fontWeight: "bold", marginY: "1rem" }}
        >
          المادة الخامسة: الإجراءات الوقائية
        </Typography>
        <p style={{ marginTop: "1rem", marginBottom: "1rem" }}>
          سعيًا من (شركة تطبيق عقارتك التجارية) لرفع مستوى وجودة الخدمة المقدمة
          لمستخدمي (منصة عقارتك)، وتبعًا لاستخدامك هذه الشروط والأحكام فإنك
          توافق و تعطي (شركة تطبيق عقارتك التجارية) الحق في تطبيق أي من
          الإجراءات التالية دون سابق إنذار إذا تقرر لديها أنك خرقت اتفاقية
          الشروط والأحكام الخاصة بـ(منصة عقارتك):
        </p>
        <ol style={{ marginRight: "20px" }}>
          <li>
            إيقاف عضويتك وحظرك بشكل مؤقت أو دائم من استخدام كل أو أي من خدمات
            (منصة عقارتك)، مع الاحتفاظ بالحق في عدم تعويضك عن أي خدمات مدفوعة
            مسبقًا.
          </li>
          <li>
            حذف كافة أو أي من المواد أو المحتوى الذي قام (المستخدم) بنشره على
            (منصة عقارتك).
          </li>
          <li>التبليغ عن الأنشطة الخاصة بك الى السلطات المختصة.</li>
          <li>تخاذ أي إجراءات قانونية ضدك.</li>
        </ol>
        <Typography
          sx={{ marginTop: "2rem", fontWeight: "bold", marginY: "1rem" }}
        >
          المادة السادسة: الإجراءات الوقائية
        </Typography>
        <p style={{ marginTop: "1rem", marginBottom: "1rem" }}>
          عند استخدامك (منصة عقارتك) فإنك تفهم وتوافق على الآتي:
        </p>
        <ol style={{ marginRight: "20px" }}>
          <li>
            لا تقدم (شركة تطبيق عقارتك التجارية) أي ضمانات ولا تتحمل أي مسؤولية
            في حالة عدم التزام (المستخدم) باتفاقية الشروط والأحكام ولا نتحمل
            المسؤولية عن أي مخاطرة أو أضرار أو تبعات أو خسائر تقع عليه أو على أي
            طرف آخر.
          </li>
          <li>
            لا تقدم (شركة تطبيق عقارتك التجارية) أي ضمان أو تتحمل أية مسؤولية عن
            دقة أو اكتمال أو صحة أي من المعلومات الواردة في المحتوى المنشور على
            (منصة عقارتك) من قبل (المستخدمين)، ولا مدى التزامه بالأنظمة
            والقوانين المطبقة ذات العلاقة، ويتحمل.
          </li>
          <li>
            لا تتحمل (شركة تطبيق عقارتك التجارية) في أي حال من الأحوال المسؤولية
            عن أية أضرار (بما في ذلك -دون حصر-: التعويض عن فقدان البيانات أو
            الأرباح، أو انقطاع الأعمال) التي تنشأ من استخدام أو عدم القدرة على
            استخدام المحتوى والمواد على (منصة عقارتك).
          </li>
          <li>
            لا تتحمل (شركة تطبيق عقارتك التجارية) أي مسؤولية تجاه عن أية خسارة
            أو ضرر، ناشئ أو يتعلق بالآتي:
          </li>
          <ol style={{ marginRight: "25px" }}>
            <li>
              أية عطل بسبب البرنامج أو أخطاء في شبكة الإنترنت أو عدم التوفر أو
              أي أسباب أخرى خارجة عن إرادتنا المعقولة.
            </li>
            <li>
              أي فقدان لكلمة المرور أو الحساب إذا كان بسبب انقطاع الكهرباء أو
              حدوث خطأ بها أو توقفها أو بسبب نظام الكمبيوتر الخاص بك أو الحساب
              الخاص بك الاعتماد على أي محتوى أو معلومات تم عرضها على (منصة
              عقارتك)،
            </li>
            <li>
              أي خسارة مباشرة أو تبعية أو خاصة أو جزائية أو ضرر أو تكاليف أو
              نفقات أو خسارة أرباح أو خسارة أعمال أو خسارة الشهرة أو تراجع
              الشهرة أو فقد البيانات أو تلفها أو فسادها.
            </li>
          </ol>
          <li></li>لا تتحمل (شركة تطبيق عقارتك التجارية) مسؤولية أي خسارة أو ضرر
          ينتج من أي فيروس أو هجوم أدى لقطع الخدمة أو مواد أخرى ضارة تقنيًا تصيب
          أجهزتك أو برامجك الحاسوبية أو البيانات أو الممتلكات الأخرى نتيجة
          استخدامكم (منصة عقارتك) أو تحميلك أي محتوى عليها أو على أي موقع مرتبط
          بها.
        </ol>
        <Typography
          sx={{ marginTop: "2rem", fontWeight: "bold", marginY: "1rem" }}
        >
          المادة السابعة: سياسة حقوق الملكية الفكرية
        </Typography>
        <p style={{ marginTop: "1rem", marginBottom: "1rem" }}>
          عند مشاركة أي محتوى على (منصة عقارتك)، مثل النصوص والصور والتسجيلات
          الصوتية والفيدو وأي أنواع أخرى من المحتوى، بأي شكل أو طريقة، فإنك تفهم
          وتوافق على الآتي:
        </p>
        <ul style={{ marginRight: "20px" }}>
          <li>
            إعطاء (منصة عقارتك) حق غير محصور وقتًا أو مكانًا وغير قابل للنقض
            وغير مدفوع قابل للتوزيع والنقل للغير لنسخ وتعديل وتحريف وتوزيع ونشر
            ذلك المحتوى دون أي قيود.
          </li>
          <li>
            تحمل تبعات أي محتوى مشارك والتعهد بكون مالك أو لك الحق في إعطاء
            (منصة عقارتك) الحقوق المذكورة في هذه السياسة.
          </li>
          <li>
            تحمل تبعات لتعدي المحتوى المشارك حقوق الملكية الفكرية أو الخصوصية
            لأي طرف ثالث.
          </li>
          <li>
            عدم احتواء المحتوى المشارك على مواد تشهيرية أو هجومية أو انتهاكية أو
            مضرة أو تهديدية أو مسيئة أو ملتوية أو عنصرية أو غير ملائمة أخلاقيًا
            أو غير ذلك من محتوى أو معلومات غير قانونية.
          </li>
          <li>
            إذا تضمن المحتوى المشارك أي معلومات شخصية، فإن سياسة الخصوصية تحكم
            استخدام (منصة عقارتك). إذا دفعت (منصة عقارتك) لإنتاج المحتوى أو
            ساعدت في إنتاجه فقد تملك (منصة عقارتك) ذلك المحتوى.
          </li>
        </ul>
        <Typography
          sx={{ marginTop: "2rem", fontWeight: "bold", marginY: "1rem" }}
        >
          المادة الثامنة: سياسة خصوصية البيانات
        </Typography>
        <p style={{ marginTop: "1rem", marginBottom: "1rem" }}>
          باستخدامك (منصة عقارتك) فإنك توافق على الآتي:
        </p>
        <ol style={{ marginRight: "20px" }}>
          <li>
            قيام (منصة عقارتك) بجمع معلوماتك الشخصية وبيانات تفاعلك على (منصة
            عقارتك) لتطوير وتحسين الخدمات المقدمة. تشمل هذه المعلومات:
            <ol style={{ marginRight: "10px" }}>
              <li>عنوان الـIP.</li>
              <li>البريد الإلكتروني.</li>
              <li>رقم الجوال.</li>
              <li>نوع وبيانات الجهاز والمتصفح.</li>
              <li>بيانات الهوية الوطنية.</li>
              <li>بيانات السجل التجاري.</li>
              <li>بيانات الصكوك وملكية العقارات.</li>
              <li>بيانات الدفع.</li>
              <li>بيانات الحساب البنكي.</li>
              <li>المحتوى الذي تقوم بنشره على (منصة عقارتك).</li>
              <li>بيانات التفاعل والتصفح على (منصة عقارتك).</li>
              <li>الرسائل الخاصة على (منصة عقارتك).</li>
            </ol>
          </li>
          <li>
            قيام (منصة عقارتك) باستخدام هذه البيانات للأسباب التالية:
            <ol style={{ marginRight: "20px" }}>
              <li>
                تقديم أفضل الخدمات ومنحك تجربة خاصة والعمل على تلبية احتياجاتك
                الفردية على أفضل وجه.
              </li>
              <li>تطوير أداء استخدام الموقع.</li>
              <li>تحسين خدمة المستخدمين .</li>
              <li>إرسال تنبيهات ورسائل وإشعارات لمستخدمي (منصة عقارتك).</li>
              <li>
                عمل إحصائيات وأبحاث وتقارير عن الخدمات والمجالات التي تخدمها
                (منصة عقارتك).
              </li>
              <li>
                التحقق من عمليات الدفع في الخدمات المتوفرة على (منصة عقارتك).
              </li>
              <li>
                مشاركة هذه المعلومات مع الشركاء الذين يقدمون خدمات تحليل
                البيانات والتسويق بالقدر الضروري.
              </li>
              <li>
                مشاركة هذه المعلومات مع جهات تنفيذ القانون استجابة للطلبات
                القانونية التي قد نتلقاها.
              </li>
            </ol>
          </li>
          <li>
            قيام (شركة تطبيق عقارتك التجارية) بتوثيق وأرشفة الشكاوي والوقائع
            المخالفة والاحتفاظ بها لتقديمها للجهات ذات العلاقة.
          </li>
        </ol>
        <Typography
          sx={{ marginTop: "2rem", fontWeight: "bold", marginY: "1rem" }}
        >
          المادة التاسعة: تعديل الاتفاقية
        </Typography>
        <p style={{ marginTop: "1rem", marginBottom: "1rem" }}>
          عند استخدامك (منصة عقارتك) فإنك توافق وتقر بأننا قد نقوم بعمل أي تحديث
          أو تغيير أو تعديل على الشروط والأحكام في أي وقت وبدون سابق إنذار. وأن
          أي تعديلات على الشروط والأحكام تصبح سارية المفعول بمجرد نشرها على
          (منصة عقارتك)، ولن يكون لها أي أثر رجعي على أي تعاملات تمت مسبقًا من
          خلال (منصة عقارتك).
        </p>
      </Box>
    </Container>
  );
};

export default PrivaceyRules;
